package com.freeit.methodicaltasks;
/*
13) Создать последовательность
случайных чисел,
найти и вывести наибольшее
из них.
 */
public class Task13 {

    public static void main(String[] args) {
        System.out.println(Math.max(5,2,9,13,18,4,10));
    }
}


